<template>
  <div class="story section fp-auto-height fp-normal-scroll" :data-anchor="this.$options.name">
    <div class="container container_full">
      <div class="grid">
        <div class="span-3">
          <blockquote class="quote">
            Имидж современной<br/>
            технологичной страны Япония<br/>
            в наших глазах не оправдала.<br/>
            Зато тунец и угорь там бесподобные
          </blockquote>
          <img class="story__photo" src="./alex-story-photo1.jpg" alt="">
          <blockquote class="quote">
            За время участия в программе<br/>
            Miles & More я налетал 1 600 000 миль.<br/>
            Почти как в фильме<br/>
            «Снова в небо»
          </blockquote>
          <img class="story__photo" src="./alex-story-photo2.jpg" alt="">
        </div>
        <div class="span-6 offset-1">
          <h1 class="heading">На передовой прогресса</h1>
          <p class="paragraph">
            Компьютерное зрение помогает анализировать видеоинформацию в реальном времени. Если раньше специалисты
            анализировали видеозаписи после того, как случится происшествие, то сейчас, благодаря прогрессу в области
            искусственного интеллекта и глубокого обучения, компьютеры помогают сразу определить, что происходит в поле
            зрения камер.
          </p>
          <p class="paragraph">
            Сейчас весь мир идёт к такому анализу в реальном времени. Если что-то происходит, то можно сразу послать
            сигнал тревоги. Компьютерным зрением и искусственным интеллектом занимается весь цивилизованный мир. Но,
            несомненно, США являются признанным лидером в сфере разработок и самым крупным рынком в мире.
          </p>
          <p class="paragraph">
            <v-waypoint @waypoint="setVisible"></v-waypoint>
            <v-waypoint @waypoint="changeMile"></v-waypoint>
            Удивительно, но Япония оказалась не такой высокотехнологичной, как я думал.
            Ты прилетаешь в токийский аэропорт и тебя встречает такси 1960 года аля Toyota Camry, но со своим
            японским названием и с восьмидесятилетним водителем, который не знает английского. Ты показываешь на
            бумаге адрес в виде иероглифов — водитель не знает этого места, а в машине нет даже навигатора.
          </p>
          <p class="paragraph">
            Ещё несколько лет назад в японских ресторанах и банкоматах не принимали западные карты. Мы нашли только
            одно место — это была почта, но она очень рано закрывается. Ни в метро, ни в такси мы не смогли расплатиться
            картами. Имидж современной технологичной страны Япония в наших глазах не оправдала. Зато тунец и угорь там
            бесподобные.
          </p>
          <v-waypoint @waypoint="changeMile"></v-waypoint>
          <h1 class="heading">Снова в небо</h1>
          <p class="paragraph">
            Девяносто процентов моих перелётов связаны с работой.
            Обычно при моей загруженности я лечу 14 непрерывных суток в году, то есть полных две недели по 24 часа.
            Я насчитал порядка 40 стран, где мне удалось побывать. Это вся Европа, вся Северная Америка, Азия,
            некоторые страны Ближнего Востока и совсем немного Южная Америка. Когда-то мне помогали с составлением
            маршрута полёта и бронью гостиниц и авиабилетов, но вообще я люблю делать всё сам. Первый раз я улетел из
            страны в 1998 году. С Lufthansa я начал летать в 1999 году, когда 1-2 раза в год летал из США домой в Нижний
            в гости. Тогда я летал немного. Мои частые перелёты начались с 2006 года. Уже семь лет я обладаю статусом Сенатора.
            За время участия в программе <a target="_blank"
                                            href="https://www.miles-and-more.com/online/portal/mam/ru/account/enrolment?l=ru&cid=1000348&campid=disp_forbes_1117_textlink__mml">Miles & More</a>
            я налетал 1.600.000 миль. Почти как в фильме «Снова в небо» с Джорджем Клуни. В общей сложности, я много раз облетел земной шар.
          </p>
          <v-waypoint @waypoint="changeMile"></v-waypoint>
          <p class="paragraph">
            Накопление миль для меня не самоцель. В моём случае они живут своей жизнью, а когда приходит время следующей
            поездки, я смотрю на свой баланс и решаю воспользоваться им или нет. Так я три раза летал с семьёй в Америку,
            а недавно купил пять билетов бизнес-класса на Мальдивы — <a target="_blank"
                                                                        href="http://www.miles-and-more.com/online/portal/mam/ru/homepage?nodeid=2312229&l=ru&cid=1000348&campid=disp_forbes_1117_logo__mml">и всё за мили</a>.
          </p>
          <p class="paragraph">
            Во время перелёта мне часто приходится работать, и тут очень кстати приходится интернет на борту. Бывало,
            что за перелёт я отправлял порядка 200–300 писем. Однако я стараюсь избегать такого, если нет жёсткой
            необходимости: лучше посмотреть кино или почитать. Хорошо, что Lufthansa предлагает новинки кино прямо
            на борту. Для человека, который бывает в кинотеатре не чаще двух раз в год, это просто спасение.
          </p>
          <p class="paragraph">
            В рабочих поездках я часто <a target="_blank"
                                          href="http://www.miles-and-more.com/online/portal/mam/ru/homepage?nodeid=2312229&l=ru&cid=1000348&campid=disp_forbes_1117_logo__mml">беру автомобиль в прокат</a>.
            Я доверяю только крупным международным компаниям, которые давно зарекомендовали себя. Это легко и быстро.
            <v-waypoint @waypoint="changeMile"></v-waypoint>
          </p>
          <h1 class="heading">Привилегии в небе и на земле</h1>
          <p class="paragraph">
            Я всегда <a target="_blank"
                        href="http://www.miles-and-more.com/online/portal/mam/ru/homepage?nodeid=2312229&l=ru&cid=1000348&campid=disp_forbes_1117_logo__mml">заранее
            выбираю себе место в самолёте</a>. С Lufthansa я могу сделать это ещё до оплаты билета. Мой выбор,
            как правило, — просторное место у запасного выхода или место у прохода.
          </p>
        </div>
        <banner :index="3"></banner>
        <div class="span-3">
          <blockquote class="quote">
            В Lufthansa я очень люблю<br/>
            отношение к клиентам. Я летал<br/>
            со многими компаниями, и<br/>
            Lufthansa  остается моей<br/>
            любимой
          </blockquote>
          <img class="story__photo" src="./alex-story-photo3.jpg" alt="">
        </div>
        <div class="span-6 offset-1">
          <p class="paragraph">
            Когда ты много летаешь, многие вещи становятся особенно важными. Например, ты пришёл в аэропорт и видишь
            очередь на регистрацию в эконом. Lufthansa делает специальные очереди для своих частолетающих пассажиров.
            С картой SENATOR я могу пройти в очередь для первого класса, вне зависимости от того, каким классом лечу.
            Так я экономлю минут 20-30. Я также могу <a target="_blank"
                                                        href="http://www.miles-and-more.com/online/portal/mam/ru/homepage?nodeid=2312229&l=ru&cid=1000348&campid=disp_forbes_1117_logo__mml">выбрать специальные места</a>,
            которые недоступны обычным пассажирам, и запросить повышение класса, когда регистрируюсь онлайн. Чем выше
            твой статус в программе — тем больше возможностей.
          </p>
          <p class="paragraph">
            Однажды из-за метели отменили самолёт из Франкфурта в Москву. Я был вынужден остаться. При этом, ко мне
            снова было особое отношение: я прошёл в <a target="_blank"
                                                       href="http://www.miles-and-more.com/online/portal/mam/ru/homepage?nodeid=2312229&l=ru&cid=1000348&campid=disp_forbes_1117_logo__mml">спецочередь</a>
            и сэкономил время, после чего меня бесплатно поселили в гостиницу и накормили.
          </p>
          <p class="paragraph">
            В Lufthansa я очень люблю такое отношение к клиентам. Бывали разные сложные ситуации, но команда
            всегда тебя слышит и помогает тебе. Я летал со многими компаниями, и Lufthansa остаётся моей любимой.
            <v-waypoint @waypoint="changeMile"></v-waypoint>
          </p>
          <h1 class="heading">Когда смена городов становится привычкой</h1>
          <p class="paragraph">
            Я был в порядка 100–200 городов по всему миру, но в них меня практически ничего не привлекает.
            Гораздо больше я люблю природу. Например, моё любимое место в Америке — Большой каньон. Там я был раз 7-8,
            а в апреле этого года я наконец-то осуществил свою старую мечту: прошёл с южной кромки каньона до реки
            Колорадо и поднялся обратно. Это 6 часов пути, 27 километров и полуторакилометровый перепад по высоте.
            Когда выпадает выходной в районе Сан-Франциско/Силиконовой Долины, я обычно хожу по национальным паркам,
            как Йосемити, или еду на озеро Тахо. В окрестностях Лос Анжелеса есть сказочные по красоте места, как Долина
            Смерти и Национальный парк секвой. В Ирландии и Норвегии фантастической красоты фьорды. Природа меня
            привлекает больше городов, именно она делает мои путешествия особенными.
          </p>
        </div>
        <banner :index="4"></banner>
        <div class="span-6 offset-4">
          <p class="paragraph">
            Из всех городов мне сложно выделить один любимый. В Америке это будут техасский Остин, Бостон и
            Сан-Франциско; в Европе — Прага, Лондон, Мюнхен, Берн и Париж.
          </p>
          <p class="paragraph">
            Из-за объёма путешествий я давно перестал возить сувениры. Если бы я из каждой поездки привозил по
            тарелочке или магнитику, мне можно было бы открывать свой магазин или заказывать 50 холодильников.
            Сейчас я могу привезти что-то жене из косметики или шоколад детям.
          </p>
          <p class="paragraph">
            <v-waypoint @waypoint="changeMile"></v-waypoint>
            Начиная с 2006 года, я провожу от четырёх до шести месяцев в году за границей. Условно, я раз в месяц
            лечу в Америку и в этот же месяц могу один-два раза слетать на несколько дней в Европу — такой ритм жизни.
            Были годы, когда мне приходилось считать дни, чтобы они не перевалили за полгода, иначе я потерял бы статус
            налогового резидента РФ. Однажды я подобрался к 180 дням за границей, но обычно все легче — около 120 дней
            в году.
          </p>
          <p class="paragraph">
            Есть хорошее выражение, которое характеризует моё состояние в пути — You get numb (Ты входишь в оцепенение
            — англ.). Я не испытываю дискомфорт, даже когда в поездке происходит что-то негативное. И никогда не хлопаю
            после посадки самолета. Для меня полёты — это обыденно.
            <v-waypoint @waypoint="setInvisible"></v-waypoint>
          </p>
        </div>
      </div>
    </div>
  </div>
</template>

<script>
  import Story from '../story/story'

  export default {
    extends: Story,
    name: 'alex-story',
    data () {
      return {
        hero: 'alex',
        milesCount: 6
      }
    }
  }
</script>

<style lang="scss" src="../story/story.scss"></style>
