<template>
  <div class="story section">
    <div class="container container_full">
      <div class="grid">
        <div class="span-3">
          <blockquote class="quote">
            Мы благодарны Lufthansa<br>
            GROUP за то, что она<br>
            единственная не берет<br>
            аэропортовый сбор за виолончель
          </blockquote>
          <img
            class="story__photo"
            src="../assets/hero-igor/igor-story-photo1.jpg"
            alt=""
          >
          <blockquote class="quote">
            Мы привыкли искать не только<br>
            удобные перелеты, но и<br>
            тарифы, которые приносят<br>
            наибольшее количество миль
          </blockquote>
          <img
            class="story__photo"
            src="../assets/hero-igor/igor-story-photo2.jpg"
            alt=""
          >
        </div>
        <div class="span-6 offset-1">
          <h1 class="heading">
            Пассажир особого класса
          </h1>
          <p class="paragraph">
            Наш камерный ансамбль — один из старейших струнных квартетов в мире. Мы постоянно летаем с гастролями по
            России и за рубежом и облетели практически всё, кроме Африки — там рынок классической музыки минимальный для нас.
          </p>
          <p class="paragraph">
            В квартете, как известно, четыре музыканта, но <a
              target="_blank"
              href="http://www.miles-and-more.com/online/portal/mam/ru/homepage?nodeid=2312229&l=ru&cid=1000348&campid=disp_forbes_1117_logo__mml"
            >билетов мы покупаем пять</a>,
            потому что отдельное место достаётся виолончели. Этот хрупкий и габаритный инструмент не вынес бы перелёта в
            багажном отделении, поэтому мы берём его с собой в салон, где виолончель занимает место, как обычный пассажир.
            Причём, не важно, будет это эконом или бизнес-класс.
          </p>
          <span v-waypoint="{ active: true, callback: (props) => setBonusesVisibility({...props, value: true}) }"></span>
          <p class="paragraph" v-waypoint="{ active: true, callback: changeMile }">
            Мы благодарны Lufthansa GROUP за то, что она единственная не берёт аэропортовый сбор за виолончель.
            Инструмент ведь есть не просит и другими сервисами не пользуется. Зато этот дополнительный билет приносит
            нам премиальные мили, равно как и обычный пассажирский билет.
          </p>
          <h1 class="heading">
            Мили повсюду
          </h1>
          <p class="paragraph">
            Мы постоянно летаем вчетвером, у каждого из нас статус Сенатора в Lufthansa. На наш взгляд, программа
            <a
              target="_blank"
              href="https://www.miles-and-more.com/online/portal/mam/ru/account/enrolment?l=ru&cid=1000348&campid=disp_forbes_1117_textlink__mml"
            >Miles & More</a>
            —
            лучшая в мире по степени заработка миль и удержания статуса. Когда ты уже являешься
            держателем статуса, тебе дают не просто премиальные, но статусные мили.
          </p>
          <p class="paragraph">
            Мы привыкли искать не только удобные перелеты, но и тарифы, которые приносят наибольшее количество миль.
            К счастью, у Lufthansa прозрачная система накопления, и ты заранее можешь прикинуть, сколько заработаешь на перелёте.
          </p>
          <p class="paragraph" v-waypoint="{ active: true, callback: changeMile }">
            Чтобы накопить больше миль, мы каждый раз предъявляем карты <a
              target="_blank"
              href="https://www.miles-and-more.com/online/portal/mam/ru/account/enrolment?l=ru&cid=1000348&campid=disp_forbes_1117_textlink__mml"
            >Miles & More</a>,
            когда берём машину напрокат или бронируем отель. Как минимум, мы получаем однократное начисление за сам факт проката или заселения.
            Иногда <a
              target="_blank"
              href="http://www.miles-and-more.com/online/portal/mam/ru/homepage?nodeid=2312229&l=ru&cid=1000348&campid=disp_forbes_1117_logo__mml"
            >попадаются акции и специальные предложения от партнёров программы</a>.
          </p>
          <p class="paragraph" v-waypoint="{ active: true, callback: changeMile }">
            Обычные покупки тоже помогают пополнить баланс премиальных миль. Во многих аэропортах есть магазины-партнеры,
            где мы тоже предъявляем карточки <a
              target="_blank"
              href="https://www.miles-and-more.com/online/portal/mam/ru/account/enrolment?l=ru&cid=1000348&campid=disp_forbes_1117_textlink__mml"
            >Miles & More</a>.
            Если что-то не успели купить до перелёта, покупаем это прямо на борту.
          </p>
          <p class="paragraph">
            Обычно планированием маршрута занимается наш менеджер, но иногда мы планируем поездку сами. На длинных
            трансатлантических рейсах мы <a
              target="_blank"
              href="http://www.miles-and-more.com/online/portal/mam/ru/homepage?nodeid=2312229&l=ru&cid=1000348&campid=disp_forbes_1117_logo__mml"
            >тратим мили на апгрейды до бизнес-класса</a>.
            Бывало поднимали до первого класса. При том, что мы тратим мили регулярно, нам всё равно удаётся зарабатывать их больше.
          </p>
        </div>
        <banner :banner="$store.state.banners[0]"/>
        <div class="span-6 offset-4">
          <p class="paragraph" v-waypoint="{ active: true, callback: changeMile }">
            Недавно Lufthansa уменьшила стоимость аэропортового сбора для мильных билетов и добавила возможность
            <a
              target="_blank"
              href="http://www.miles-and-more.com/online/portal/mam/ru/homepage?nodeid=2312229&l=ru&cid=1000348&campid=disp_forbes_1117_logo__mml"
            >оплатить</a>
            его милями. Получается, вы можете вообще не тратить деньги на билет.
          </p>
          <h1 class="heading">
            Весь мир открыт для вдохновения
          </h1>
          <p class="paragraph" v-waypoint="{ active: true, callback: changeMile }">
            Во время путешествий меня может вдохновлять радость от перемещения в другую точку земного шара, от чувства
            полета, а также приятные люди, которых я встречаю. Самолёт — это часть нашей профессиональной жизни и,
            к счастью, она не видится нам какой-то рутиной, хотя мы совершаем несколько десятков рейсов в год, так что в
            сумме получается минимум неделя-другая в воздухе.
          </p>
          <p class="paragraph">
            На первом месте для меня всегда стоит человеческий фактор: приятное общение делает любую поездку интереснее.
            Поэтому нам нравится время, проведенное с командой Lufthansa. Это не просто вежливые и любезные, но всегда
            харизматичные люди и превосходные профессионалы своего дела.
          </p>
          <span v-waypoint="{ active: true, callback: changeMile }"></span>
        </div>
        <banner :banner="$store.state.banners[1]"/>
        <div class="span-3">
          <blockquote class="quote">
            В полётах с Lufthansa<br>
            я чувствую заботу<br>
            и внимание к мелочам<br>
            на всём пути.<br>
            Мой первый перелёт с немецкой
            компанией проходил из Нижнего
            Новгорода во Франкфурт
          </blockquote>
          <img
            class="story__photo"
            src="../assets/hero-igor/igor-story-photo3.jpg"
            alt=""
          >
        </div>
        <div class="span-6 offset-1">
          <p class="paragraph">
            Конечно, мы черпаем вдохновение и из своего репертуара. Как для пилота музыка — это небо и самолёты,
            так для нас это произведения великих композиторов: Прокофьева, Чайковского, Шостаковича, Моцарта, Бетховена
            и, конечно, нашего патрона Бородина.
          </p>
          <p class="paragraph">
            В детстве у меня была мечта стать лётчиком. Я обожал летать на самолёте, ещё когда был маленьким. Любил,
            когда самолёт подбрасывает в воздухе — чем сильней, тем лучше. Я даже расстраивался, если мы не попадали в
            зону турбулентности во время полёта. Сейчас, конечно, я предпочитаю более комфортные перелёты.
          </p>
          <h1 class="heading">
            Увидеть мир и отдохнуть
          </h1>
          <p class="paragraph">
            В поездках у нас бывает немного времени, чтобы увидеть что-то из местных достопримечательностей.
            Обычно это связано с природой, архитектурой и музеями. В каждой стране есть что-то особенное, что хочется
            привезти домой, поэтому у меня нет какого-то типичного сувенира, вроде тарелок или брелоков, которые я привожу:
            это всегда что-то характерное для этого места
          </p>
          <p class="paragraph">
            Мне очень сложно назвать одно любимое место во всём мире. Тут точно так же, как и с любимым произведением
            или композитором: слишком много шедевров. Пожалуй, самые яркие впечатления за всё время оставили Австралия,
            Новая Зеландия и Япония, а самые запоминающиеся автомобильные дороги для меня пролегают в Баварии, горной
            Австрии и Южном Тироле. В горах я получаю эстетическое удовольствие; это связь с чем-то внеземным. Хотя
            отдыхать всё же предпочитаю на море.
          </p>
          <p class="paragraph" v-waypoint="{ active: true, callback: changeMile }">
            Изредка мне удаётся путешествовать вместе с семьёй, хотя наши предпочтения сходятся не всегда: если летом
            родные стремятся отправиться к океану, на испанский Тенерифе, то я предпочитаю слетать в Карловы Вары и Прагу.
          </p>
          <h1 class="heading">
            Мили — это надолго
          </h1>
          <p class="paragraph">
            В поездках у нас бывает немного времени, чтобы увидеть что-то из местных достопримечательностей.
            Обычно это связано с природой, архитектурой и музеями. В каждой стране есть что-то особенное,
            что хочется привезти домой, поэтому у меня нет какого-то типичного сувенира, вроде тарелок или брелоков,
            которые я привожу: это всегда что-то характерное для этого места.
          </p>
          <p class="paragraph">
            Мне очень сложно назвать одно любимое место во всём мире. Тут точно так же, как и с любимым произведением
            или композитором: слишком много шедевров. Пожалуй, самые яркие впечатления за всё время оставили Австралия,
            Новая Зеландия и Япония, а самые запоминающиеся автомобильные дороги для меня пролегают в Баварии, горной
            Австрии и Южном Тироле. В горах я получаю эстетическое удовольствие: это связь с чем-то внеземным.
            Хотя отдыхать всё же предпочитаю на море.
          </p>
          <span v-waypoint="{ active: true, callback: (props) => setBonusesVisibility({...props, value: false}) }"></span>
        </div>
      </div>
    </div>
  </div>
</template>

<script>
import Story from './Story'
import { HERO_IGOR_NAME } from '../constants'

export default {
  name: 'IgorStory',
  extends: Story,
  data () {
    return {
      hero: HERO_IGOR_NAME,
      milesCount: 7
    }
  }
}
</script>
