<template>
  <a :href="banners[index].link" target="_blank" class="banner span-12">
    <span class="banner__text">
      <span class="banner__text-name" v-html="banners[index].title"></span>
      <span class="banner__text-description" v-html="banners[index].description"></span>
      <svg class="banner__text-lufthansa-logo" xmlns="http://www.w3.org/2000/svg" width="148" height="25"
           viewBox="0 0 691.00001 118"><path
        d="M118.004 59.118c0 32.684-26.31 58.882-59.113 58.882C26.44 118 0 91.686 0 59.234 0 26.078 26.44 0 59.947 0c31.864 0 58.057 26.787 58.057 59.118m-111.86 0c0 29.145 23.598 52.744 52.747 52.744 29.256 0 52.98-23.48 52.98-52.628 0-29.733-23.363-53.1-53.336-53.1-28.672 0-52.39 23.956-52.39 52.984zm39.882-2.362l-.705 1.417c-2.713-.588-7.675-2.478-12.864-4.836l-.708 1.297 2.126 1.18c7.556 3.893 10.034 4.717 14.394 4.717 8.732 0 15.34-4.956 18.41-13.684 5.43-1.06 12.388-1.533 20.653-1.533 7.08 0 13.218.352 21.12 1.293l-2 2.478c-3.66-.472-10.387-.94-15.223-.94-5.786 0-9.442.12-11.327.236l-.945 2.122c4.836-.237 6.606-.237 10.377-.237 6.375 0 11.447.237 15.575.59l-2 2.598c-7.437-.237-10.86-.353-16.406-.353-3.065 0-5.303.116-8.972.237l-.94 2.122c3.182-.238 7.55-.354 12.156-.354 4.368 0 9.56.116 12.624.237l-1.997 2.594c-2.134-.12-6.253-.12-9.445-.12-5.073 0-11.443.24-14.75.708l-.946 1.89c6.013-.588 9.793-.824 16.4-.824 2.603 0 4.247 0 7.198.237l-2.242 2.715c-4.007-.236-5.304-.236-6.842-.236-11.216 0-18.522 1.65-25.846 5.777 6.727 6.73 17.938 11.327 27.968 11.327.83 0 1.297 0 3.42-.112l-4.838 4.832c-26.66-6.962-31.387-8.848-55.81-23.358-9.678-5.55-17.586-9.325-23.956-11.21l.825-2.956c1.538.24 4.84 1.185 7.908 2.246l1.408-3.187 26.203 11.09zM216.39 19.708v63.125h33.276v15.58h-52.98V19.708h19.704m74.46 78.705l-.588-5.545c-4.6 4.832-9.798 7.078-16.283 7.078-8.03 0-14.52-3.307-17.82-8.97-2.486-4.247-2.834-6.37-2.834-15.694V41.77h18.526v32.803c0 8.26 2.358 11.684 8.14 11.684 6.138 0 9.2-4.012 9.2-11.684V41.77h18.527v56.643h-16.87zm58.883-66.197h-3.067c-6.838 0-8.617 1.65-8.617 7.904v1.65h10.978v12.507h-10.98v44.136h-18.52V54.277h-8.025V41.77h8.024v-1.65c0-14.867 5.55-20.412 20.06-20.412h10.146v12.508zm28.44-8.144V41.77h10.497v12.507h-10.497v22.418c.11 8.265.584 8.737 7.667 8.737h3.66v12.98h-13.926c-10.975 0-15.932-5.076-15.932-16.635v-27.5h-7.788V41.77h7.788V24.07h18.53zm33.976-4.364v28.436c3.427-5.546 8.264-8.024 15.467-8.024 7.783 0 14.038 3.303 17.466 9.32 2.474 4.37 2.826 6.727 2.826 16.17v32.803h-18.412v-32.1c0-8.14-2.474-11.8-8.14-11.8-6.13 0-9.204 4.012-9.204 11.8v32.1h-18.518V19.708h18.513zm43.67 40.12c0-12.866 10.022-20.417 26.783-20.417 17.58 0 26.314 7.32 26.314 22.187v28.908c0 4.952 0 4.952 1.533 7.908h-17.113l-1.065-4.72c-5.898 5.188-10.975 7.078-18.397 7.078-12.513 0-21.602-7.434-21.602-17.696 0-8.5 5.545-14.52 16.4-17.586 1.653-.468 7.083-1.533 16.404-3.303 4.012-.824 5.55-2.122 5.55-4.836 0-3.19-3.308-5.315-8.265-5.315-6.018 0-9.557 2.835-9.673 7.792h-16.87zm35.266 11.442c-2.35.71-3.058.945-4.953 1.533-2.228.593-4.24 1.066-6.713 1.538-6.027 1.535-8.978 3.893-8.978 7.553 0 3.655 2.84 5.78 7.436 5.78 8.964 0 13.208-4.015 13.208-12.39V71.27zm41.193-29.5l.592 6.374c4.364-5.546 9.562-8.024 16.41-8.024 7.898 0 14.268 3.423 17.57 9.32 2.36 4.37 2.836 6.843 2.836 16.17v32.803h-18.526v-32.1c0-8.376-2.353-11.8-8.14-11.8-6.017 0-9.084 4.012-9.084 11.8v32.1h-18.526V41.77h16.867zm78.12 17.7c-.472-5.31-2.72-7.315-8.384-7.315-4.6 0-7.44 1.775-7.44 4.72 0 2.716 2.714 4.365 8.853 5.31l6.378 1.177c13.444 2.247 19.703 7.908 19.703 17.706 0 12.036-10.265 19.703-26.313 19.703-19 0-29.385-7.55-29.385-21.24h18.053v.71c0 4.72 3.892 7.67 10.15 7.67 5.43 0 8.738-2.005 8.738-5.193 0-3.307-3.072-5.188-10.28-6.49l-5.897-.945c-13.445-2.358-19.226-7.2-19.226-16.164 0-12.272 10.266-19.707 27.138-19.707 11.804 0 19.115 3.188 22.89 10.03 1.654 2.83 1.895 3.776 2.363 10.03H610.4zm25.837.357c.12-12.744 10.15-20.416 27.023-20.416 17.585 0 26.198 7.32 26.198 22.187v28.908c0 4.84 0 4.84 1.542 7.908h-17.233l-.945-4.72c-6.843 5.55-10.86 7.078-18.41 7.078-12.62 0-21.71-7.434-21.71-17.696 0-8.5 5.55-14.52 16.4-17.586 1.654-.468 7.083-1.653 16.41-3.303 3.89-.824 5.544-2.122 5.544-4.836 0-3.19-3.307-5.315-8.148-5.315-6.014 0-9.665 2.95-9.665 7.792h-17.006zM671.64 71.27c-2.362.71-3.196.945-5.086 1.533-1.993.357-4.248.83-6.722 1.538-6.014 1.535-8.965 3.893-8.965 7.553 0 3.655 2.835 5.78 7.552 5.78 8.963 0 13.216-4.015 13.216-12.39V71.27z"
        fill="#ffb300"/></svg>
    </span>
    <img class="banner__image" :src="banners[index].image" alt=""/>
  </a>
</template>

<script>
  export default {
    props: ['index'],
    name: 'banner',
    data () {
      return {
        banners: [
          {
            title: 'Выиграйте 1 000 000 миль за<br/>покупки на борту',
            description: 'До 31 октября Lufthansa разыгрывает миллион премиальных миль.<br/>Вам достаточно лишь купить что-нибудь во время перелёта.',
            image: require('./banner-image-1.jpg'),
            link: 'http://www.miles-and-more.com/online/portal/mam/rowr/earn/flight?l=ru&cid=10001'
          },
          {
            title: 'Арендуйте Audi в аэропорту<br/>Мюнхена и получите 3000 миль',
            description: 'Выбирайте машину под любой случай и отправляйтесь в путешествие. Аренда<br/>' +
            'минимум на 8 часов принесёт вам три тысячи премиальных миль в аэропорту<br/>' +
            'имени Франца-Йозефа Штрауса.',
            image: require('./banner-image-2.jpg'),
            link: 'http://www.miles-and-more.com/online/portal/mam/rowr/earn/car_rental?l=ru&cid=10001'
          },
          {
            title: 'В 2 раза больше миль от Marriott:<br/>соберите до 35 000 бонусов этой осенью',
            description: 'Станьте участником программы Marriott Rewards® и получите в два раза больше<br/>' +
            'миль за проживания в период с 31 июля по 29 октября.' +
            'имени Франца-Йозефа Штрауса.',
            image: require('./banner-image-3.jpg'),
            link: ''
          },
          {
            title: 'Получите 1000 дополнительных<br/>миль в отелях Westin, Sheraton и W Hotels',
            description: 'Проведите две ночи в одном из партнёрских отелей программы Starwood<br/>' +
            'Preferred Guest до 31 декабря и получите дополнительно тысячу миль.' +
            'имени Франца-Йозефа Штрауса.',
            image: require('./banner-image-4.jpg'),
            link: 'http://www.miles-and-more.com/online/portal/mam/rowr/earn/hotel?l=ru&cid=10001'
          },
          {
            title: 'Получите 10 000 миль в октябре за<br/>первое бронирование отеля через сайт Miles & More',
            description: 'До 30 ноября - 500 миль за первое скачивание приложения Miles & More',
            image: require('./banner-image-5.jpg'),
            link: 'http://www.miles-and-more.com/online/portal/mam/rowr/earn/hotel?l=ru&cid=10001'
          }
        ]
      }
    }
  }
</script>

<style lang="scss" src="./banner.scss"></style>
